       IDENTIFICATION DIVISION.
       PROGRAM-ID. DCIA8PGR.
       AUTHOR. ANDREW MAYNE, SHREEJI PATEL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-STU-NUM PIC X(7).

       01 WS-COMMAREA     PIC X(1) VALUE 'X'.
       01 WS-COMMAREA-LEN PIC S9(4) COMP VALUE 1.
      * COPY INQUIRY MAP LAYOUT
       COPY 'DCIA8MR'.

      * COPY STUREC RECORD LAYOUT
       COPY 'STUREC'.

       LINKAGE SECTION.

       01 DFHCOMMAREA PIC X(1).

       PROCEDURE DIVISION.

       000-START-LOGIC.

           IF (EIBCALEN = 1) THEN
                GO TO 100-FIRST-TIME
           END-IF.

      * UPON UNSUCCESSFUL MAP RECEIVE, ASSUME THIS IS THE INITIAL RUN
      * TODO: ADD CONDITION FOR RECORD NOT FOUND IN ACCTFILE
           EXEC CICS HANDLE CONDITION
                MAPFAIL(100-FIRST-TIME)
                NOTFND(300-NOTFND)
           END-EXEC.

      * ATTEMPT TO RECEIVE MAP FROM TERMINAL
           EXEC CICS RECEIVE
                MAP('MAP1')
                MAPSET('DCIA8MR')
           END-EXEC.

      * RECEIVE WAS SUCCESSFUL, PROCEED WITH MAIN PROCESSING
           GO TO 200-MAIN-LOGIC.

       100-FIRST-TIME.

           MOVE LOW-VALUES TO MAP1O.

           EXEC CICS SEND
               MAP('MAP1')
               MAPSET('DCIA8MR')
               ERASE
           END-EXEC.

           EXEC CICS RETURN
               TRANSID('IA81')
           END-EXEC.

       200-MAIN-LOGIC.

           MOVE STU-NUMI TO WS-STU-NUM.

           IF (STU-NUML = 0)
                MOVE 'YOU MUST ENTER STUDENT NUMBER' TO MSGO
                GO TO 320-COMMON-CICS
           END-IF.

           IF (STU-NUML > 0 AND STU-NUML < 7)
                MOVE 'STUDENT NUMBER MUST BE 7-DIGIT LONG NUMBER'
                TO MSGO
                GO TO 320-COMMON-CICS
           END-IF.

           IF (WS-STU-NUM = 'XXXXXXX')
                GO TO 999-EXIT
           END-IF.

           IF (WS-STU-NUM IS NOT NUMERIC)
                MOVE 'STUDENT NUMBER MUST BE NUMERIC' TO MSGO
                GO TO 320-COMMON-CICS
           END-IF.

       250-FOUND.
      * TODO: ATTEMPT TO FIND AN ACCOUND RECORD IN ACCTFILE
      *       FROM USER INPUT ACCOUNTNO
           MOVE STU-NUMI TO STU-NUMBER.
           EXEC CICS READ
                FILE('STUFILE')
      *         RECORD IDENTIFIACTION FIELD
                RIDFLD(STU-KEY)
                INTO(STUFILE-RECORD)
           END-EXEC.


      * RECORD FOUND, MOVE VALUES TO MAP OUTPUTS
           MOVE LOW-VALUES TO MAP1O.
           MOVE "RECORD FOUND!" TO MSGO.

           MOVE WS-STU-NUM TO STU-NUMO.
      * TODO: MOVE VALUES FROM ACCTREC TO O FIELDS
           MOVE STU-NAME TO STU-NAMEO.
           MOVE STU-COURSE-1 TO COURSE-1O.
           MOVE STU-COURSE-2 TO COURSE-2O.
           MOVE STU-COURSE-3 TO COURSE-3O.
           MOVE STU-COURSE-4 TO COURSE-4O.
           MOVE STU-COURSE-5 TO COURSE-5O.


           MOVE STU-ADDRESS-1 TO ADDRSS-1O.
           MOVE STU-ADDRESS-2 TO ADDRSS-2O.
           MOVE STU-ADDRESS-3 TO ADDRSS-3O.
           MOVE STU-POSTAL-1 TO POSTAL-1O.
           MOVE STU-POSTAL-2 TO POSTAL-2O.

           MOVE '(' TO BRACK-1O.
           MOVE ')' TO BRACK-2O.
           MOVE '-' TO DASHO.

           MOVE STU-PHONE-1 TO PHONE-1O.
           MOVE STU-PHONE-2 TO PHONE-2O.
           MOVE STU-PHONE-3 TO PHONE-3O.

           EXEC CICS SEND
                MAP('MAP1')
                MAPSET('DCIA8MR')
                ERASE
           END-EXEC.

           EXEC CICS RETURN
                TRANSID('IA81')
           END-EXEC.

       300-NOTFND.

           MOVE LOW-VALUES TO MAP1O.
           MOVE 'ACCOUNT NOT FOUND' TO MSGO.

           EXEC CICS SEND
                MAP('MAP1')
                MAPSET('DCIA8MR')
                ERASE
           END-EXEC.

           EXEC CICS RETURN
                TRANSID('IA81')
           END-EXEC.

       320-COMMON-CICS.
           EXEC CICS SEND
                MAP('MAP1')
                MAPSET('DCIA8MR')
                ERASE
           END-EXEC.

           EXEC CICS RETURN
                TRANSID('IA81')
           END-EXEC.

       999-EXIT.
           EXEC CICS XCTL
                PROGRAM('DCIA8PGM')
                COMMAREA(WS-COMMAREA)
                LENGTH(WS-COMMAREA-LEN)
           END-EXEC.
      *    MOVE LOW-VALUES TO MAP1O.
      *    MOVE 'PROGRAM ENDING' TO MSGO.
      *    EXEC CICS SEND MAP('MAP1') MAPSET('DCIA8MM') END-EXEC.
      *    EXEC CICS RETURN END-EXEC.


       END PROGRAM DCIA8PGR.
